fe40/tutorials/rheoFoam/CrossSlot/Oldroyd-BLog/0/C.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   
    inlet_north
    {
       type            fixedValue;
       value           uniform 1;
    }
    inlet_south
    {
       type            fixedValue;
       value           uniform 0;
    }
    outlet_west
    {
        type            zeroGradient;
    }
    outlet_east
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
